{
    "title": "US: Trump outlines sweeping policy agenda in TV interview ",
    "paragraphs": [
        "US President-elect Donald Trump has begun to exercise power before even taking office. In an interview, he spoke of the drastic policy changes he intends to enact once he assumes power.",
        "President-elect Donald Trump on Sunday sat down for his first network television interview since being elected on November 5. He outlined several sweeping policy changes — both domestic and international — during the course of the discussion.",
        "Trump said he intends to enact many of the changes he has in mind for the economy, immigration, foreign and defense policy and more, as soon as he is sworn in on January 20, 2025.",
        "Speaking with host Kristen Welker on NBC's \"Meet the Press,\" Trump said he plans to enact radical changes to US immigration policy, most strikingly, abolishing birthright citizenship, which is anchored in the constitution.",
        "Calling it \"ridiculous,\" Trump said he would use executive action to end the right to citizenship for those born on US soil, regardless of their parents' immigration status, on his first day back in the White House.",
        "Asked if he would carry through with his promise to deport every illegal immigrant in the US while in office, Trump said, \"I think you have to do it, and it's a hard… it's a very tough thing to do. But you have to have rules, regulations, laws. They came in illegally.\"",
        "Trump said that he and fellow Republicans were open, however, to discussing ways to help so-called \"Dreamers\" brought to the US illegally as children.",
        "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video",
        "Speaking about economics and trade, Trump wouldn't promise that his plan to put high tariffs on foreign goods entering the US as part of his so-called \"America First\" policy would not end up biting US consumers, saying: \"I can't guarantee anything. I can't guarantee tomorrow.\"",
        "Trump also said he had no plans to replace Jerome Powell as the chairman of the US Federal Reserve, despite having sparred with him regularly in the past over Fed policy.",
        "Trump broke precedent during his first stint in the White House by directly seeking to exert pressure on the central bank to affect its actions. Powell last month said he would refuse to step down if Trump tried to remove him before the end of his current term.",
        "When asked about reproductive rights and birth control, Trump said he would not limit access to abortion pills.",
        "Another \"day-one\" promise Trump made on Sunday was that he would look at issuing pardons \"very quickly\" for jailed January 6 defendants imprisoned for their role in the 2021 insurrection at the US Capitol.",
        "Hundreds of Trump-supporting rioters remain behind bars and dozens have been convicted and sentenced to prison. Their cause has been championed by many on the far-right, both in politics and in the media. Trump, who headlined events that day, has come under pressure to set them free.  ",
        "Although he won't take the oath of office until January 20, Trump is already actively influencing world affairs. On Saturday, he met with Ukrainian President Volodymyr Zelenskyy and French President Emmanuel Macron before attending the re-opening of Notre Dame Cathedral in Paris.",
        "On Sunday, he told the world \"Ukraine wants to make a deal\" to end the war in Ukraine, and called on Russian President Vladimir Putin to end the fighting.",
        "When asked in the interview — which was taped Friday, before Trump and Zelenskyy met — whether he would reduce US aid to Ukraine, Trump said, \"Possibly, yeah, probably, sure.\"",
        "Trump also spoke about the NATO military alliance, of which he has been highly critical in the past. Trump has repeatedly hinted at withdrawing the US from the powerful 32-member military alliance.",
        "Asked if the US would remain in the alliance on his watch, Trump said, \"If they're paying their bills, and if I think they're treating us fairly, the answer is absolutely I'd stay with NATO.\" If allies, however, weren't paying their fair share, or treating the US fairly in Trump's eyes, then he said, he would \"absolutely\" consider leaving.   ",
        "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video",
        "js/rmt (AFP, Reuters)"
    ]
}